Revit 2026 API

# CurveLength Property

---

The exact length of the curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Length { get; }
```
```vb
Public ReadOnly Property Length As Double
	Get
```
```cpp
public:
property double Length {
	double get ();
}
```
```fsharp
member Length : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the curve is unbound and not periodic. |

Computes the length of the curve using analytical or numeric integration. There is no performance hit for lines and arcs.

#### Reference

Curve Class

Autodesk.Revit.DB Namespace